//logs.js
const util = require('../../utils/util.js')
var bus_details = [
  {
    stations:["欣园","慧园","创园","荔园","教工餐厅","社康中心","专家公寓","三号门","一号门","行政楼","七号门","科研楼"],
    workday: ["07:20", "07:25", "07:30", "07:35", "07:40","08:00", "08:10", "08:20", "08:30", "08:40","08:50", "09:00", "09:20", "09:40", "09:50","09:55", "10:00", "10:05", "10:20", "10:40", "11:00", "11:20", "11:40", "12:00", "12:10","12:20", "12:30", "12:40", "13:00", "13:20","13:30", "13:35", "13:40", "14:00", "14:20","14:40", "15:00", "15:20", "15:40", "15:50","15:55", "16:00", "16:05", "16:20", "16:40","17:00", "17:10", "17:20", "17:30", "17:40","17:50", "18:00", "18:20", "18:40", "19:00","19:30", "20:00", "20:30", "21:00"],
    vacation: ["07:30","08:00","08:30","09:00","09:30","10:00","10:30","11:00","11:30","12:00","12:30","13:00","13:30","14:00","14:30","15:00","15:30","16:00","16:30","17:00","17:30","18:00","19:00","20:00","21:00"], 
  },
  {
    stations:["科研楼","七号门","行政楼","一号门","三号门","专家公寓","教工餐厅","荔园","创园","慧园","欣园"],
    workday: ["07:40","07:50","08:00","08:10","08:20","08:30","08:40","08:50","09:00","09:20","09:40","09:55","10:00","10:05","10:10","10:20","10:40","11:00","11:20","11:40","12:00","12:10","12:20","12:30","12:40","13:00","13:20","13:40","14:00","14:20","14:40","15:00","15:20","15:40","15:50","15:55","16:00","16:05","16:20","16:40","17:00","17:10","17:20","17:30","17:40","17:50","18:00","18:10","18:20","18:30","18:40","19:00","19:30","20:20","21:20","22:00"],
    vacation:["07:50","08:20","08:50","09:20","09:50","10:20","10:50","11:20","11:50","12:20","12:50","13:20","13:50","14:20","14:50","15:20","15:50","16:20","16:50","17:20","17:50","18:20","19:20","20:20","21:20","21:50","22:00"],
  },
  {
    stations:["集悦城","六号门","荔园","慧园"],
    workday:["07:20","07:30","09:40","09:50","13:30"],
    vacation: null,
  },
  {
    stations:["荔园","慧园","行政楼","七号门","集悦城"],
    workday: ["12:40","18:40","22:20"],
    vacation: null,
  },

]

Page({
  data: {
    _num:'0',
    from: "出发地",
    dest: "目的地",
    stations: [],
    time_work:[],
    time_vocation:[],
    time_now:"00:00"
  },

  // 点击切换页面
  toggle(e) {
    console.log(e.currentTarget.dataset.index);
    if (this.data._num === e.currentTarget.dataset.index) {
      return false;
    } else {
      this.setData({
        _num: e.currentTarget.dataset.index
      })
    }
  },

  // 滑动切换页面
  bindChange: function (e) {
    var that = this;
    console.log(e)
    that.setData({
      _num: e.detail.current
    });
    switch (e.detail.current) {
      case 0:
        that.data.state = 0
        break;
      case 1:
        that.data.state = 1
        break;
    }
  },

  onLoad: function (option) {
    console.log(option.id)
    console.log(bus_details)
    this.setData({
      from: bus_details[option.id].stations[0],
      dest: bus_details[option.id].stations[bus_details[option.id].stations.length-1],
      stations: bus_details[option.id].stations,
      time_work: bus_details[option.id].workday,
      time_vocation: bus_details[option.id].vacation
    })
    console.log(this)
  }
})
